In [1]:
import pandas as pd

In [4]:
%cd pandas_data_files/

/Users/jimdoone/Desktop/pandas_data_files

In [5]:
%ls

50_Startups.csv                       employees.csv
Baby_Names.xlsx                       foods.csv
Data - Multiple Worksheets.xlsx       fortune1000.csv
Data - Single Worksheet.xlsx          google_stock_price.csv
Restaurant - Customers.csv            jamesbond.csv
Restaurant - Foods.csv                nba.csv
Restaurant - Week 1 Sales.csv         pokemon.csv
Restaurant - Week 1 Satisfaction.csv  quarters.csv
Restaurant - Week 2 Sales.csv         revenue.csv
bigmac.csv                            salesmen.csv
chicago.csv                           worldstats.csv
ecommerce.csv

In [7]:
df = pd.read_csv('employees.csv')
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [9]:
df['First Name'].unique()

array(['Douglas', 'Thomas', 'Maria', 'Jerry', 'Larry', 'Dennis', 'Ruby',
       nan, 'Angela', 'Frances', 'Louise', 'Julie', 'Brandon', 'Gary',
       'Kimberly', 'Lillian', 'Jeremy', 'Shawn', 'Diana', 'Donna', 'Lois',
       'Matthew', 'Joshua', 'John', 'Craig', 'Scott', 'Terry', 'Benjamin',
       'Christina', 'Joyce', 'Jean', 'Theresa', 'Rachel', 'Linda',
       'Stephanie', 'Michael', 'Christine', 'Beverly', 'Marilyn',
       'Cynthia', 'Roger', 'Bruce', 'Kathy', 'Clarence', 'Chris', 'Nancy',
       'Todd', 'Alan', 'Sara', 'Karen', 'Carl', 'Henry', 'Irene', 'Paula',
       'Denise', 'Kathleen', 'Steve', 'Jose', 'Johnny', 'Bobby', 'Bonnie',
       'Margaret', 'Charles', 'Robin', 'Gerald', 'Christopher', 'Steven',
       'Doris', 'Annie', 'Janice', 'James', 'Virginia', 'Harry', 'Heather',
       'Laura', 'Tina', 'Harold', 'Melissa', 'Aaron', 'Jack', 'Phyllis',
       'Paul', 'Russell', 'Shirley', 'Willie', 'Ashley', 'Pamela',
       'Andrea', 'Peter', 'Helen', 'Patricia', 'Michelle', 'William',
       'Kenneth', 'Antonio', 'Rebecca', 'Carlos', 'Carolyn', 'Gloria',
       'Adam', 'Elizabeth', 'Teresa', 'Nicole', 'Jennifer', 'Philip',
       'Patrick', 'Sean', 'Ruth', 'Victor', 'Marie', 'Howard', 'Norma',
       'Arthur', 'Mary', 'Wayne', 'Jane', 'Jessica', 'Mark', 'Randy',
       'Sandra', 'Carol', 'Barbara', 'Ronald', 'Jonathan', 'Katherine',
       'Emily', 'Lisa', 'Evelyn', 'Gregory', 'Billy', 'Jason', 'Daniel',
       'Sarah', 'George', 'Diane', 'Kathryn', 'Cheryl', 'Kevin', 'Walter',
       'Robert', 'Jimmy', 'Fred', 'Brenda', 'Justin', 'Betty', 'Sharon',
       'Ralph', 'Edward', 'Debra', 'Anne', 'Roy', 'Frank', 'Nicholas',
       'Judy', 'Tammy', 'Jesse', 'Joan', 'Ernest', 'Jacqueline', 'Jeffrey',
       'Samuel', 'Earl', 'Richard', 'Lori', 'Susan', 'Juan', 'Albert',
       'Stephen', 'Rose', 'Joe', 'Julia', 'Dorothy', 'Deborah', 'Alice',
       'Wanda', 'Lawrence', 'Amy', 'Ryan', 'Judith', 'Eugene', 'Donald',
       'Ann', 'Raymond', 'Catherine', 'Amanda', 'Anna', 'Joseph', 'Andrew',
       'Kelly', 'Louis', 'Mildred', 'Eric', 'Timothy', 'Anthony', 'Martha',
       'Brian', 'Martin', 'Janet', 'Keith', 'Phillip', 'David'], dtype=object)

##### Pass the unique column in the len column

In [11]:
len(df['First Name'].unique())

201

In [10]:
df['Team'].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

##### nunique() returns the number of unique values
- nunique does not include NaN values in its opertion
- to include NaN values, change the default parameter: dropna = False

In [12]:
df['Team'].nunique()

10